
## :white_check_mark: Apply Succeeded (mng)

[CI link](https://github.com/fumi-mura/infra_portfolio/actions/runs/14484606638)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.sdlc_organizations.data.aws_organizations_organization.this: Reading...
module.iam_identity_center.data.aws_ssoadmin_instances.this: Reading...
module.oidc_iam_policy.data.aws_iam_policy_document.this: Reading...
data.aws_ssm_parameter.this: Reading...
module.prod_organizations.data.aws_organizations_organization.this: Reading...
data.aws_caller_identity.current: Reading...
module.oidc_provider.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::313744126666:oidc-provider/token.actions.githubusercontent.com]
module.oidc_iam_policy.data.aws_iam_policy_document.this: Read complete after 0s [id=1789900679]
module.oidc_iam_policy.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::313744126666:policy/mng-fumis-pf-oidc-iam-policy]
data.aws_caller_identity.current: Read complete after 0s [id=313744126666]
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Reading...
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=4294844229]
module.oidc_iam_role.aws_iam_role.this: Refreshing state... [id=mng-fumis-pf-oidc-iam-role]
data.aws_ssm_parameter.this: Read complete after 0s [id=email_local_pert]
module.iam_identity_center.data.aws_ssoadmin_instances.this: Read complete after 0s [id=ap-northeast-1]
module.iam_identity_center.aws_ssoadmin_permission_set.this["AdministratorAccess"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-016128be1f0d2c70,arn:aws:sso:::instance/ssoins-775858b230c132be]
module.iam_identity_center.aws_ssoadmin_permission_set.this["ReadOnlyAccess"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-5d3e704c703d417c,arn:aws:sso:::instance/ssoins-775858b230c132be]
module.iam_identity_center.aws_identitystore_group.this["Admin"]: Refreshing state... [id=d-9567439836/17249a58-1071-7002-35d6-aa949f7b7414]
module.iam_identity_center.aws_identitystore_group.this["ReadOnly"]: Refreshing state... [id=d-9567439836/97f4ba88-f0c1-70bd-44dc-5f3f91a51779]
module.iam_identity_center.aws_identitystore_user.this["ReadOnly"]: Refreshing state... [id=d-9567439836/47845a08-20b1-709d-6c84-e72c65c83967]
module.iam_identity_center.aws_identitystore_user.this["Admin"]: Refreshing state... [id=d-9567439836/57344af8-5091-7024-7358-e523c32873a5]
module.prod_organizations.data.aws_organizations_organization.this: Read complete after 1s [id=o-7i9v8e304z]
module.prod_organizations.aws_organizations_organizational_unit.this: Refreshing state... [id=ou-f0ch-wogsonqy]
module.sdlc_organizations.data.aws_organizations_organization.this: Read complete after 1s [id=o-7i9v8e304z]
module.sdlc_organizations.aws_organizations_organizational_unit.this: Refreshing state... [id=ou-f0ch-9vwf46cy]
module.iam_identity_center.aws_ssoadmin_managed_policy_attachment.this["ReadOnlyAccess"]: Refreshing state... [id=arn:aws:iam::aws:policy/ReadOnlyAccess,arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-5d3e704c703d417c,arn:aws:sso:::instance/ssoins-775858b230c132be]
module.iam_identity_center.aws_ssoadmin_managed_policy_attachment.this["AdministratorAccess"]: Refreshing state... [id=arn:aws:iam::aws:policy/AdministratorAccess,arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-016128be1f0d2c70,arn:aws:sso:::instance/ssoins-775858b230c132be]
module.iam_identity_center.aws_identitystore_group_membership.this["Admin"]: Refreshing state... [id=d-9567439836/17642af8-9041-70d5-e799-644f5e2cf104]
module.iam_identity_center.aws_identitystore_group_membership.this["ReadOnly"]: Refreshing state... [id=d-9567439836/77744a58-9041-70c5-4fa0-a1fc31f467ad]
module.prod_organizations.aws_organizations_account.this["prd01"]: Refreshing state... [id=644370126241]
module.sdlc_organizations.aws_organizations_account.this["dev01"]: Refreshing state... [id=598981015011]
module.iam_identity_center.aws_ssoadmin_account_assignment.this["644370126241"]: Refreshing state... [id=57344af8-5091-7024-7358-e523c32873a5,USER,644370126241,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-016128be1f0d2c70,arn:aws:sso:::instance/ssoins-775858b230c132be]
module.iam_identity_center.aws_ssoadmin_account_assignment.this["313744126666"]: Refreshing state... [id=57344af8-5091-7024-7358-e523c32873a5,USER,313744126666,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-016128be1f0d2c70,arn:aws:sso:::instance/ssoins-775858b230c132be]
module.iam_identity_center.aws_ssoadmin_account_assignment.this["598981015011"]: Refreshing state... [id=57344af8-5091-7024-7358-e523c32873a5,USER,598981015011,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-016128be1f0d2c70,arn:aws:sso:::instance/ssoins-775858b230c132be]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test_1_s3.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "mng-fumis-pf-test-1-s3-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "mng-fumis-pf-test-1-s3-bucket"
        }
      + tags_all                    = {
          + "Environment"        = "mng"
          + "ManagedByTerraform" = "true"
          + "Name"               = "mng-fumis-pf-test-1-s3-bucket"
          + "ServiceName"        = "fumis-pf"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.test_1_s3.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.test_1_s3.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = "mng-fumis-pf-test-1-s3-bucket"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.test_1_s3.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.test_1_s3.aws_s3_bucket.this: Creating...
module.test_1_s3.aws_s3_bucket.this: Creation complete after 4s [id=mng-fumis-pf-test-1-s3-bucket]
module.test_1_s3.aws_s3_bucket_public_access_block.this: Creating...
module.test_1_s3.aws_s3_bucket_server_side_encryption_configuration.this: Creating...
module.test_1_s3.aws_s3_bucket_versioning.this: Creating...
module.test_1_s3.aws_s3_bucket_public_access_block.this: Creation complete after 0s [id=mng-fumis-pf-test-1-s3-bucket]
module.test_1_s3.aws_s3_bucket_server_side_encryption_configuration.this: Creation complete after 1s [id=mng-fumis-pf-test-1-s3-bucket]
module.test_1_s3.aws_s3_bucket_versioning.this: Creation complete after 2s [id=mng-fumis-pf-test-1-s3-bucket]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":30,"Program":"tfcmt","SHA1":"2155a08685b177a944b1514193952229e080c358","Target":"mng","Vars":{},"WorkflowName":"Apply"} -->